[
    {
      "ID": 1,
      "Joke": "[me narrating a documentary about narrators] \"I can't hear what they're saying cuz I'm talking\""
    },
    {
      "ID": 2,
      "Joke": "Telling my daughter garlic is good for you. Good immune system and keeps pests away.Ticks, mosquitos, vampires... men."
    },
    {
      "ID": 3,
      "Joke": "I've been going through a really rough period at work this week It's my own fault for swapping my tampax for sand paper."
    },
    {
      "ID": 4,
      "Joke": "If I could have dinner with anyone, dead or alive... ...I would choose alive. -B.J. Novak-"
    },
    {
      "ID": 5,
      "Joke": "Two guys walk into a bar. The third guy ducks."
    },
    {
      "ID": 6,
      "Joke": "Why can't Barbie get pregnant? Because Ken comes in a different box. Heyooooooo"
    },
    {
      "ID": 7,
      "Joke": "Why was the musician arrested? He got in treble."
    },
    {
      "ID": 8,
      "Joke": "Did you hear about the guy who blew his entire lottery winnings on a limousine? He had nothing left to chauffeur it."
    },
    {
      "ID": 9,
      "Joke": "What do you do if a bird shits on your car? Don't ask her out again."
    },
    {
      "ID": 10,
      "Joke": "He was a real gentlemen and always opened the fridge door for me"
    },
    {
      "ID": 11,
      "Joke": "Telling my daugthers date that \"she has lice and its very contagious the closer you get to her.\" *Correct way to parent."
    },
    {
      "ID": 12,
      "Joke": "What should you do before criticizing Pac-Man? WAKA WAKA WAKA mile in his shoes"
    },
    {
      "ID": 13,
      "Joke": "What's the difference between an illegal Mexican and an autonomous robot...? Nothing... they were both made to steal American jobs."
    },
    {
      "ID": 14,
      "Joke": "What do you call a barbarian you can't see? an Invisigoth."
    },
    {
      "ID": 15,
      "Joke": "How do you spell Canda? C,eh,N,eh,D,eh"
    },
    {
      "ID": 16,
      "Joke": "You ever notice that the most dangerous thing about marijuana is getting caught with it?"
    },
    {
      "ID": 17,
      "Joke": "What did Arnold Schwarzenegger say at the abortion clinic? Hasta last vista, baby."
    },
    {
      "ID": 18,
      "Joke": "My wife is in a bad mood. I think her boyfriend forgot their anniversary. Way to go, dude. Now we all suffer..."
    },
    {
      "ID": 19,
      "Joke": "My speech today will be like a mini-skirt. Long enough to cover the essentials but short enough to hold your attention!"
    },
    {
      "ID": 20,
      "Joke": "Thanksgiving joke What does Miley Cyrus eat for Thanksgiving? Twerky! Just kidding... Drugs. She eats drugs. -Adam Zopf @adamzopf"
    },
    {
      "ID": 21,
      "Joke": "Why do you never see elephants hiding in trees? 'Cause they are freaking good at it"
    },
    {
      "ID": 22,
      "Joke": "How did the blonde die raking leaves? She fell out of the tree."
    },
    {
      "ID": 23,
      "Joke": "\"That guy is such a douche-bag! Is he single? Maybe I can fix him!\"  women"
    },
    {
      "ID": 24,
      "Joke": "My son just got a tattoo of a heart, a spade, a club, and a diamond, all without my permission. I guess I'll deal with him later."
    },
    {
      "ID": 25,
      "Joke": "What do you call a potato in space? Spudnik"
    },
    {
      "ID": 26,
      "Joke": "How to get a cop's attention"
    },
    {
      "ID": 27,
      "Joke": "What happens to a necrophiliac after death? Reserection"
    },
    {
      "ID": 28,
      "Joke": "Why did the chicken hold a seance? To get to the other side."
    },
    {
      "ID": 29,
      "Joke": "Where do baby cows go to eat lunch? At the calf-eteria."
    },
    {
      "ID": 30,
      "Joke": "What's the difference between a painting and Jesus. You only require one nail to put up the painting."
    },
    {
      "ID": 31,
      "Joke": "Mom: \"Do you want this?\" Me: \"No.\" Mom: \"Ok I'll give it to your brother.\" Me: \"No I want it.\""
    },
    {
      "ID": 32,
      "Joke": "How do you fit 4 gays on one barstool? Flip it over!"
    },
    {
      "ID": 33,
      "Joke": "I am looking forward to 6pm Thanksgiving Day when Walmart opens its doors for its annual sale of trampled human corpses."
    },
    {
      "ID": 34,
      "Joke": "Yttrium-barium-copper oxide walks into a bar The bartender tells him, \"We don't serve superconductors here.\" He leaves without resistance."
    },
    {
      "ID": 35,
      "Joke": "A guy pick up a woman Then he puts her down"
    },
    {
      "ID": 36,
      "Joke": "Every night, I take all of the singles out of my wallet, spread them on the bed, and pretend I was pretty that day."
    },
    {
      "ID": 37,
      "Joke": "Which gospel contains Jesus' parable about the shades of numbers? Math hue."
    },
    {
      "ID": 38,
      "Joke": "Ibuprofen is my favorite headache medicine that also sounds like a reggae professor."
    },
    {
      "ID": 39,
      "Joke": "Ted Cruz getting elected."
    },
    {
      "ID": 40,
      "Joke": "Before I destroy a wasp's nest I like to capture a single wasp and tell it my entire diabolical plan."
    },
    {
      "ID": 41,
      "Joke": "What's Al-Qaeda's favorite American football team? The New York jets."
    },
    {
      "ID": 42,
      "Joke": "INTERVIEWER: Why do you want to work here? ME: *crumbs tumbling from my mouth* Oh, I don't. I was just walking by and saw you had donuts."
    },
    {
      "ID": 43,
      "Joke": "Coming on valentines day. Fifty shades of grey. There won't be a dry seat in the cinema."
    },
    {
      "ID": 44,
      "Joke": "Did you hear about the midget psychic who escaped from prison? He's a small medium at large."
    },
    {
      "ID": 45,
      "Joke": "Someone didnt click the button in /r/thebutton Yeah... Thats a good joke , he impossible!"
    },
    {
      "ID": 46,
      "Joke": "What's the difference between a car tyre, and 365 condoms? One's a Goodyear, an the other's a great year."
    },
    {
      "ID": 47,
      "Joke": "Roses are red, Violets are blue. I have a gun. Get in the van."
    },
    {
      "ID": 48,
      "Joke": "I've struggled for years to be above the influence... But I've never been able to get that high"
    },
    {
      "ID": 49,
      "Joke": "With Facebook, you can stay in touch with people you would otherwise never talk to, but that's only one of the many awful things about it"
    },
    {
      "ID": 50,
      "Joke": "What's the difference between a blonde and a washer? When you dump your load in a washer, it doesn't follow you around for a week."
    },
    {
      "ID": 51,
      "Joke": "Have you ever heard of the movie \"Constipation\"? No? Most likely because it never came out."
    },
    {
      "ID": 52,
      "Joke": "What's black, blue and doesn't look too well? Stevie Wonder"
    },
    {
      "ID": 53,
      "Joke": "I saw a French rifle on eBay today It's never been fired but I heard it was dropped once."
    },
    {
      "ID": 54,
      "Joke": "What did the car said to the valet? I've been through a lot."
    },
    {
      "ID": 55,
      "Joke": "Bill Clinton must be the luckiest man in the world. All of the sex he has, with Hillary, you know it's hate sex."
    },
    {
      "ID": 56,
      "Joke": "yeah girl.. shake that thing where poop comes out of. it really turns me on when your poop factory shakes faster than usual"
    },
    {
      "ID": 57,
      "Joke": "\"I can't stand when people say they hate both of the presidential candidates.\" --Stephen Hawking"
    },
    {
      "ID": 58,
      "Joke": "A Mexican fireman had twin boys He named them Jose and Hose B"
    },
    {
      "ID": 59,
      "Joke": "I was drinking at the bar, so I took a bus home. That may not be a big deal to you, but I've never driven a bus before!"
    },
    {
      "ID": 60,
      "Joke": "Donald Trump will ban the sale of shredded cheese He wants to make America grate again"
    },
    {
      "ID": 61,
      "Joke": "Things have really turned around for me since I re-named my penis and testicles \"JD Power and Associates\"."
    },
    {
      "ID": 62,
      "Joke": "My sex face is the same as my first pee in three hours face."
    },
    {
      "ID": 63,
      "Joke": "My cat just walked by me carrying a toy mouse I don't remember buying her. Women be shoppin!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "ID": 64,
      "Joke": "Why did the Xbox owner cross the road? To fuck your mom."
    },
    {
      "ID": 65,
      "Joke": "Sometimes you check the amount of subscribed people. When you do this, there are 4,111,093,0003.666 \"humorists\". 2/3rds of a person? Really?"
    },
    {
      "ID": 66,
      "Joke": "I don't believe in Bigfoot; because he never believed in me. I'd scan the crowd at my ballet recitals, and always see that one empty seat."
    },
    {
      "ID": 67,
      "Joke": "What did the porn actress say when she opened the door? Make sure to come upstairs."
    },
    {
      "ID": 68,
      "Joke": "I don't judge people based on color, race, religion, sexuality, or gender...I base it on whether or not they're an asshole."
    },
    {
      "ID": 69,
      "Joke": "Why were the baker's hands brown? Because he kneaded a poo."
    },
    {
      "ID": 70,
      "Joke": "Not to get too technical, but chemistry says alcohol IS a solution. So I win."
    },
    {
      "ID": 71,
      "Joke": "I often think if I'd taken a different path in life, I could be lying on a slightly more comfortable sofa right now."
    },
    {
      "ID": 72,
      "Joke": "I'm terrible at telling jokes... I always punch up the fuck lines"
    },
    {
      "ID": 73,
      "Joke": "What did the hillbilly say to his sister after she asked him to have sex with her? If you incest."
    },
    {
      "ID": 74,
      "Joke": "\"You know what, we need a huge spoon to take care of this\" -Guy who invented shovels"
    },
    {
      "ID": 75,
      "Joke": "How to keep the flies off the bride at an Italian wedding Keep a bucket of shit next to her"
    },
    {
      "ID": 76,
      "Joke": "What do grandparents smell like? \"Depends\""
    },
    {
      "ID": 77,
      "Joke": "7% of all hearing loss is a result of sitting in a restaurant next to a table full of women who just received dessert."
    },
    {
      "ID": 78,
      "Joke": "What do people from the 1930's and /r/news jokes have in common? They're both old."
    },
    {
      "ID": 79,
      "Joke": "I like my slaves like I like my coffee Fair Trade."
    },
    {
      "ID": 80,
      "Joke": "ME: I fell off a 50 ft tall ladder once GIRL: holy cow how did you survive ME: I fell off the bottom rung"
    },
    {
      "ID": 81,
      "Joke": "What do you call a blind dinosaur? A do-think-he-saurus :) !! Lol What do you call a blind dinosaurs dog? A do-you-think-he-saurus-rex"
    },
    {
      "ID": 82,
      "Joke": "I just bought a very tiny amphibian for a pet. It's my-newt!"
    },
    {
      "ID": 83,
      "Joke": "This may be not be a mainstream opinion, but I don't believe you should cut down a Christmas tree unless you intend on eating it."
    },
    {
      "ID": 84,
      "Joke": "Jenna Jameson to Oprah, \"There's a little bit of Jenna Jameson in everyone.\" I'm pretty sure she got that backwards."
    },
    {
      "ID": 85,
      "Joke": "Even after 20 years, Jared Fogle is still getting into smaller and smaller jeans."
    },
    {
      "ID": 86,
      "Joke": "I have a degree in men's studies. It's called \"world history\". #TRUMP 2016! YOU CAN'T STUMP THE TRUMP!"
    },
    {
      "ID": 87,
      "Joke": "Why don't most fans like the first 39 episodes of DBZ? Its pretty gay, just Saiyan."
    },
    {
      "ID": 88,
      "Joke": "My ex-wife still misses me... But her aim is gettin better."
    },
    {
      "ID": 89,
      "Joke": "This doctor once told me eating a bagel was like eating 5 slices of bread and I was like ok, cool, I like bread"
    },
    {
      "ID": 90,
      "Joke": "What do you call a three-humped camel? Pregnant (Told to me by one of the kids at work)"
    },
    {
      "ID": 91,
      "Joke": "What did the two tampons say to each other? Nothing, they're both stuck-up cunts."
    },
    {
      "ID": 92,
      "Joke": "What do you call Jay-Z having a leg transplant? A hip-hop hip op."
    },
    {
      "ID": 93,
      "Joke": "What defies the law of gravity? Women. They heavier they are, the easier they are to pick up."
    },
    {
      "ID": 94,
      "Joke": "Everything has to be related in a woman: if the mouth shuts, the legs open."
    },
    {
      "ID": 95,
      "Joke": "Wanna hear a pun about long hair? Rapunzel."
    },
    {
      "ID": 96,
      "Joke": "\"I'm so pissed I could punch a ba-\" \"A what?\" Big Baby from Toy Story 3 hovers over me, sawed-off shotgun in hand. \"A bagel. I HATE carbs.\""
    },
    {
      "ID": 97,
      "Joke": "What's the difference Donald Trump and my Vagina? One's a Cunt and the other has nice hair."
    },
    {
      "ID": 98,
      "Joke": "My doctor had to put me on a new medication that's supposed to help lower the amount of karate in my blood"
    },
    {
      "ID": 99,
      "Joke": "[uses the restroom] Wife: make sure to put the toilet seat down Me: okay Me: [to toilet seat] you're worthless and nobody likes you"
    },
    {
      "ID": 100,
      "Joke": "Q: What's the difference between a blonde and a supermarket trolley? A: The supermarket trolley has a mind of its own."
    },
    {
      "ID": 101,
      "Joke": "You know... When someone says to you \"Jesus loves you.\" It's always comforting. Unless you are in a Mexican jail."
    },
    {
      "ID": 102,
      "Joke": "When I hear \"This call is being monitored for quality assurance\" I think \"Cool, let's see how bad this person wants their job.\""
    },
    {
      "ID": 103,
      "Joke": "You know what the definition of \"competitive\" is? Finishing first *and* third in a circlejerk."
    },
    {
      "ID": 104,
      "Joke": "How do you know if your wine was made in the 90's? It smells like teen spirit."
    },
    {
      "ID": 105,
      "Joke": "What was the name of Paul Revere's favorite porno mag? The British are Coming"
    },
    {
      "ID": 106,
      "Joke": "[car wreck] [hand reaches out] \"Take my hand. I'm Chad Kroeger from the popular band Nickelback.\" [I let the flames slowly bake me alive]"
    },
    {
      "ID": 107,
      "Joke": "Just waiting for Steve Harvey to come out and say it's actually Clinton any second now"
    },
    {
      "ID": 108,
      "Joke": "Chicken Why did the chicken cross the road? Why? To go to the gay guys house Knock knock Who's there? The chicken"
    },
    {
      "ID": 109,
      "Joke": "Teacher: Why do we put a hyphen in a bird-cage?  Pupil: For a parrot to perch on miss."
    },
    {
      "ID": 110,
      "Joke": "I visited Amsterdam this summer, and decided to have sex with a prostitute. It was an overall positive experience. Sadly, it was an HIV positive experience."
    },
    {
      "ID": 111,
      "Joke": "Yup. If pasta & antipasta ever touch, they annihilate. For your safety, that's why restaurants never serve them together."
    },
    {
      "ID": 112,
      "Joke": "Alcohol is like Lysol for feelings, it won't kill all of them."
    },
    {
      "ID": 113,
      "Joke": "When my wife takes a nap, it's \"desperately needed rest.\" When I do, it's \"lazy chauvinist party-time.\""
    },
    {
      "ID": 114,
      "Joke": "\"Update the Force, young Skywalker\" Said Adobe Wan Kenobi."
    },
    {
      "ID": 115,
      "Joke": "lookin for a quick and easy way to beef up that scrawny bod and really turn some heads at the beach? float dead in a lake"
    },
    {
      "ID": 116,
      "Joke": "TIL A ref can show a player the red card for a loud fart ... even if it isn't Messi."
    },
    {
      "ID": 117,
      "Joke": "What did the wise man say to the fat guy? You should probably go on a diet."
    },
    {
      "ID": 118,
      "Joke": "Who is better? The 3rd wave feminist or the pencil? The pencil is better. It has a point."
    },
    {
      "ID": 119,
      "Joke": "Guys, I think I found the Cure to Aids! It requires having a Magic Johnson."
    },
    {
      "ID": 120,
      "Joke": "Why do you call a Mexican midget a paragraph? ...because he's too short to be called an essay."
    },
    {
      "ID": 121,
      "Joke": "This morning I had a swollen testicle. \"I'd have simply preferred toast,\" I told my wife."
    },
    {
      "ID": 122,
      "Joke": "\"What's that?\" A divorce jar. Every time we fight you put a dollar in and I'm a little bit closer to freedom. *puts in dollar* \"WTH!?!\""
    },
    {
      "ID": 123,
      "Joke": "What do you call a blonde in a BMW? Optional."
    },
    {
      "ID": 124,
      "Joke": "If you have a parrot and you don't teach it to say,\"Help, they've turned me into a parrot.\" you are wasting everybody's time."
    },
    {
      "ID": 125,
      "Joke": "My 8 y/o memorized my 12 character password that has upper and lowercase letters, numbers and symbols but can't remember to flush the toilet"
    },
    {
      "ID": 126,
      "Joke": "What do you call a racist dog from Animal Crossing? KKK Slider"
    },
    {
      "ID": 127,
      "Joke": "Me: waiter, do you have frog legs? Waiter: of course monsieur Me: good, hop over there and get me a beer"
    },
    {
      "ID": 128,
      "Joke": "It's comforting to know that the US government works the same way as a college student when it comes to deadlines... They both wait until the last minute, then get an extension."
    },
    {
      "ID": 129,
      "Joke": "What did the man with The World's Largest Penis say when he had to have his legs amputated \"Don't worry, I still have my third one.\""
    },
    {
      "ID": 130,
      "Joke": "What's the worse thing to do to a blind person? Leave a plunger in the toilet"
    },
    {
      "ID": 131,
      "Joke": "When I was interviewed for a job in the chemistry department, they asked me if I had lab experience. I said I was more of a cat person."
    }]